leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606b_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef _MPC5606BPORTS_H
#define _MPC5606BPORTS_H

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_0 {21, 2}  /* E0UC[13] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU0_PAD_0 {38, 0}  /* E0UC[0] / eMIOS_0 */
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_ICU0 PORT_FUNC1
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER1 PORT_FUNC3
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER2 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_1 {39, 0}  /* E0UC[1] / eMIOS_0 */
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_3 {13, 0}  /* E1UC[3] / eMIOS_0 */
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_4 {14, 0}  /* E0UC[4] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_4 {60, 0}  /* LIN5RX / LINFlex _5 */
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_5 {15, 0}  /* E0UC[5] / eMIOS_0 */
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_6 {16, 0}  /* E0UC[6] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_6 {59, 0}  /* LIN4RX / LINFlex _4Reserved */
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_7 {17, 0}  /* E0UC[7] / eMIOS_0 */
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_8 {22, 2}  /* E0UC[14] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_8 {31, 0}  /* LIN3RX / LINFlex_3 */
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER0 PORT_FUNC2  /* Can be used for PWM and ICU */
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER2 PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_10 {18, 0}  /* E0UC[10] / eMIOS_0 */
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_LIN PORT_FUNC3
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_11 {19, 0}  /* E0UC[11] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_11 {58, 1}  /* LIN2RX / LINFlex _2 */
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER2 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_12 {40, 0}  /* E0UC[28] / eMIOS_0 */
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_SPI0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_13 {41, 0}  /* E0UC[29] / eMIOS_0 */
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_14 {5, 0}  /* SCK_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI0_PAD_14 {6, 0}  /* CS0_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_14 {38, 1}  /* E0UC[0] / eMIOS_0 */
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_SPI0 PORT_FUNC2
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_15 {5, 1}  /* SCK_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI0_PAD_15 {6, 1}  /* CS0_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_15 {39, 1}  /* E0UC[1] / eMIOS_0 */
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_SPI0 PORT_FUNC1
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_16 {42, 0}  /* E0UC[30] / eMIOS_0 */
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_LIN PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_17 {43, 0}  /* E0UC[31] / eMIOS0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_17 {62, 1}  /* LIN0RX/LINFlexD_0 */
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_18 {42, 1}  /* E0UC[30] / eMIOS_0 */
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_19 {43, 1}  /* E0UC[31] / eMIOS0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_19 {62, 0}  /* LIN0RX/LINFlexD_0 */
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_27 {6, 2}  /* CS0_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_27 {13, 1}  /* E1UC[3] / eMIOS_0 */
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_28 {14, 1}  /* E0UC[4] / eMIOS_0 */
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_29 {15, 1}  /* E0UC[5] / eMIOS_0 */
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_30 {16, 1}  /* E0UC[6] / eMIOS_0 */
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_31 {17, 1}  /* E0UC[7] / eMIOS_0 */
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_34 {7, 0}  /* SCK_1 / DSPI_1 */
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_35 {0, 0}  /* CAN1RX / FlexCAN_1 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_35 {3, 0}  /* CAN4RX / FlexCAN_4 */
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_CAN0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_36 {2, 0}  /* CAN3RX / FlexCAN_3 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_36 {8, 0}  /* SIN_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_36 {57, 0}  /* E1UC[31] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_SPI PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_38 {54, 0}  /* E1UC[28] / eMIOS_1 */
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_39 {55, 0}  /* E1UC[29] / eMIOS_1 */
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_40 {13, 2}  /* E1UC[3] / eMIOS_0 */
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_41 {17, 2}  /* E0UC[7] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_41 {58, 0}  /* LIN2RX / LINFlex _2 */
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_CAN0 PORT_FUNC2
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_ADC PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_43 {0, 1}  /* CAN1RX / FlexCAN_1 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_43 {3, 1}  /* CAN4RX / FlexCAN_4 */
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_CAN0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_44 {11, 0}  /* SIN_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_44 {20, 0}  /* E0UC[12] / eMIOS_0 */
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_45 {21, 0}  /* E0UC[13] / eMIOS_0 */
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_46 {10, 0}  /* SCK_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_46 {22, 0}  /* E0UC[14] / eMIOS_0 */
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_47 {12, 0}  /* CS0_2 / DSPI_2 */
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_60 {25, 0}  /* E0UC[24] / eMIOS_0 */
