leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606b_portdefs.h
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_61 {9, 1}  /* CS0_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_61 {26, 0}  /* E0UC[25] / eMIOS_0 */
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_62 {27, 0}  /* E0UC[26] / eMIOS_0 */
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_63 {28, 0}  /* E0UC[27] / eMIOS_0 */
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_64 {4, 0}  /* CAN5RX / FlexCAN_5 */
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_CAN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_66 {8, 1}  /* SIN_1 / DSPI_1 */
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_SPI PORT_FUNC0
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_68 {7, 1}  /* SCK_1 / DSPI_1 */
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_69 {9, 2}  /* CS0_1 / DSPI_1 */
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_ADC PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_70 {23, 0}  /* E0UC[22] / eMIOS_0 */
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_71 {24, 0}  /* E0UC[23] / eMIOS_0 */
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_72 {23, 1}  /* E0UC[22] / eMIOS_0 */
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_CAN0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_73 {1, 0}  /* CAN2RX / FlexCAN_2 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_73 {2, 1}  /* CAN3RX / FlexCAN_3 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_73 {24, 1}  /* E0UC[23] / eMIOS_0 */
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_CAN0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_74 {56, 0}  /* E1UC[30] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_75 {25, 2}  /* E0UC[24] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_75 {31, 1}  /* LIN3RX / LINFlex_3 */
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_76 {11, 1}  /* SIN_2 / DSPI_2 */
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_SPI PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_78 {10, 1}  /* SCK_2 / DSPI_2 */
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_79 {12, 1}  /* CS0_2 / DSPI_2 */
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_80 {18, 1}  /* E0UC[10] / eMIOS_0 */
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_81 {19, 1}  /* E0UC[11] / eMIOS_0 */
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_82 {12, 2}  /* CS0_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_82 {20, 1}  /* E0UC[12] / eMIOS_0 */
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_83 {21, 1}  /* E0UC[13] / eMIOS_0 */
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_84 {22, 1}  /* E0UC[14] / eMIOS_0 */
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_85 {23, 2}  /* E0UC[22] / eMIOS_0 */
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_86 {24, 2}  /* E0UC[23] / eMIOS_0 */
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_89 {1, 1}  /* CAN2RX / FlexCAN_2 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_89 {2, 2}  /* CAN3RX / FlexCAN_3 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_89 {44, 1}  /* E1UC[1] / eMIOS_1 */
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_CAN0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_90 {45, 1}  /* E1UC[2] / eMIOS_1 */
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_91 {46, 1}  /* E1UC[3] / eMIOS_1 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_91 {59, 1}  /* LIN4RX / LINFlex _4Reserved */
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_92 {51, 0}  /* E1UC[25] / eMIOS_1 */
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_93 {52, 0}  /* E1UC[26] / eMIOS_1 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_93 {60, 1}  /* LIN5RX / LINFlex _5 */
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_94 {53, 0}  /* E1UC[27] / eMIOS_1 */
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_95 {0, 2}  /* CAN1RX / FlexCAN_1 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_95 {3, 2}  /* CAN4RX / FlexCAN_4 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_95 {47, 1}  /* E1UC[4] / eMIOS_1 */
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN0 PORT_FUNC0
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_97 {4, 1}  /* CAN5RX / FlexCAN_5 */
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_99 {34, 0}  /* CS0_3 / DSPI_3 */
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_100 {32, 0}  /* SCK_3 / DSPI_3 */
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_101 {33, 0}  /* SIN_3 / DSPI_3 */
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_SPI PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_103 {56, 1}  /* E1UC[30] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER0 PORT_FUNC2 /* Can be used for PWM and ICU */
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_104 {12, 3}  /* CS0_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_104 {49, 0}  /* E1UC[17] / eMIOS_1 */
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_105 {10, 2}  /* SCK_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_105 {50, 0}  /* E1UC[18] / eMIOS_1 */
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_106 {25, 1}  /* E0UC[24] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_106 {36, 0}  /* SIN_4 / DSPI_4Reserved */
#define INPUT_SELECT_PORT_PIN_MODE_ICU0_PAD_106 {57, 1}  /* E1UC[31] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ICU0 PORT_FUNC2
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER0 PORT_FUNC2 /* Can be used for PWM and ICU */
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_107 {26, 1}  /* E0UC[25] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_107 {37, 0}  /* CS0_4 / DSPI_4Reserved */
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_108 {27, 1}  /* E0UC[26] / eMIOS_0 */
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_109 {28, 1}  /* E0UC[27] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_109 {35, 0}  /* SCK_4 / DSPI_4 */
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_111 {44, 0}  /* E1UC[1] / eMIOS_1 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_111 {61, 0}  /* LIN8RX / LINFlex _8 */
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_112 {8, 2}  /* SIN_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_112 {45, 0}  /* E1UC[2] / eMIOS_1 */
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_113 {46, 0}  /* E1UC[3] / eMIOS_1 */
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_114 {7, 2}  /* SCK_1 / DSPI_1 */
