leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606b_portdefs.h
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_114 {47, 0}  /* E1UC[4] / eMIOS_1 */
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_115 {9, 3}  /* CS0_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_115 {48, 0}  /* E1UC[5] / eMIOS_1 */
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER1 PORT_FUNC2
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_123 {37, 1}  /* CS0_4 / DSPI_4Reserved */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_123 {48, 1}  /* E1UC[5] / eMIOS_1 */
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_SPI0 PORT_FUNC2
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_124 {32, 1}  /* SCK_3 / DSPI_3 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_124 {51, 1}  /* E1UC[25] / eMIOS_1 */
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_125 {34, 1}  /* CS0_3 / DSPI_3 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_125 {52, 1}  /* E1UC[26] / eMIOS_1 */
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_SPI0 PORT_FUNC2
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_126 {35, 1}  /* SCK_4 / DSPI_4 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_126 {53, 1}  /* E1UC[27] / eMIOS_1 */
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_127 {49, 1}  /* E1UC[17] / eMIOS_1 */
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_128 {40, 1}  /* E0UC[28] / eMIOS_0 */
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_129 {41, 1}  /* E0UC[29] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_129 {61, 1}  /* LIN8RX / LINFlex _8 */
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_130 {42, 2}  /* E0UC[30] / eMIOS_0 */
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_131 {43, 2}  /* E0UC[31] / eMIOS0 */
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_132 {54, 1}  /* E1UC[28] / eMIOS_1 */
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_133 {35, 2}  /* SCK_4 / DSPI_4 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_133 {55, 1}  /* E1UC[29] / eMIOS_1 */
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_134 {37, 2}  /* CS0_4 / DSPI_4Reserved */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_134 {56, 2}  /* E1UC[30] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_135 {57, 2}  /* E1UC[31] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_139 {33, 1}  /* SIN_3 / DSPI_3 */
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_140 {34, 2}  /* CS0_3 / DSPI_3 */
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_142 {36, 1}  /* SIN_4 / DSPI_4Reserved */
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_143 {37, 3}  /* CS0_4 / DSPI_4Reserved */
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI PORT_FUNC0
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_148 {50, 1}  /* E1UC[18] / eMIOS_1 */
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Added to be able to set ADC in logical way when not using yaml file to configure.
 * This is probably only relevant when not configuring with ArcticStudio 
 */
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_ADC PORT_GPIO_APC

#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_ADC PORT_GPIO_APC

#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_ADC PORT_GPIO_APC

